{
    "datasets": [
        {
            "name": "Healthcare Dataset",
            "complexity": "Medium",
            "samples": [
                {
                    "id": 1,
                    "features": {
                        "age": 45,
                        "blood_pressure": 120,
                        "cholesterol": 200
                    },
                    "ground_truth": "Class A",
                    "model_prediction": "Class A",
                    "confidence": 0.85,
                    "explanations": {
                        "Xemble": "The model predicted Class A because the patient's age and cholesterol levels are within the normal range for this class.",
                        "SHAP": "The prediction is driven by the patient's blood pressure and age, which are the most influential features for Class A.",
                        "LIME": "The model focused on the patient's cholesterol level and age, which strongly indicate Class A."
                    }
                },
                {
                    "id": 2,
                    "features": {
                        "age": 60,
                        "blood_pressure": 140,
                        "cholesterol": 240
                    },
                    "ground_truth": "Class B",
                    "model_prediction": "Class A",
                    "confidence": 0.65,
                    "explanations": {
                        "Xemble": "The model predicted Class A due to the patient's slightly elevated blood pressure, but this may be an error as cholesterol is high.",
                        "SHAP": "The model's prediction is influenced by the patient's age, but the high cholesterol level suggests Class B might be more accurate.",
                        "LIME": "The model prioritized the patient's age, but the high cholesterol level indicates a possible misclassification."
                    }
                },
                {
                    "id": 3,
                    "features": {
                        "age": 50,
                        "blood_pressure": 130,
                        "cholesterol": 220
                    },
                    "ground_truth": "Class A",
                    "model_prediction": "Class A",
                    "confidence": 0.90,
                    "explanations": {
                        "Xemble": "The model predicted Class A because the patient's blood pressure and cholesterol levels are consistent with this class.",
                        "SHAP": "The patient's age and blood pressure are the key factors driving the prediction for Class A.",
                        "LIME": "The model's decision is based on the patient's cholesterol level and blood pressure, which align with Class A."
                    }
                }
            ]
        },
        {
            "name": "Finance Dataset",
            "complexity": "High",
            "samples": [
                {
                    "id": 1,
                    "features": {
                        "income": 75000,
                        "credit_score": 700,
                        "loan_amount": 50000
                    },
                    "ground_truth": "Class B",
                    "model_prediction": "Class B",
                    "confidence": 0.80,
                    "explanations": {
                        "Xemble": "The model predicted Class B because the loan amount and credit score are typical for this class.",
                        "SHAP": "The prediction is driven by the applicant's income and credit score, which are consistent with Class B.",
                        "LIME": "The model focused on the loan amount and credit score, which strongly indicate Class B."
                    }
                },
                {
                    "id": 2,
                    "features": {
                        "income": 100000,
                        "credit_score": 750,
                        "loan_amount": 100000
                    },
                    "ground_truth": "Class A",
                    "model_prediction": "Class B",
                    "confidence": 0.55,
                    "explanations": {
                        "Xemble": "The model predicted Class B due to the high loan amount, but the income level suggests Class A might be more accurate.",
                        "SHAP": "The model's prediction is influenced by the loan amount, but the high income level indicates a possible misclassification.",
                        "LIME": "The model prioritized the loan amount, but the high income level suggests Class A could be the correct prediction."
                    }
                },
                {
                    "id": 3,
                    "features": {
                        "income": 50000,
                        "credit_score": 650,
                        "loan_amount": 30000
                    },
                    "ground_truth": "Class B",
                    "model_prediction": "Class B",
                    "confidence": 0.75,
                    "explanations": {
                        "Xemble": "The model predicted Class B because the income and credit score are typical for this class.",
                        "SHAP": "The prediction is driven by the applicant's income and loan amount, which are consistent with Class B.",
                        "LIME": "The model focused on the credit score and loan amount, which strongly indicate Class B."
                    }
                }
            ]
        }
    ]
}